In [2]:
import pandas as pd

In [6]:
# Load dataset
df = pd.read_csv("gsearch_jobs.csv")

In [7]:
# Preview first 5 rows
df.head()

,Unnamed: 0,index,title,company_name,location,via,description,extensions,job_id,thumbnail,...,commute_time,salary_pay,salary_rate,salary_avg,salary_min,salary_max,salary_hourly,salary_yearly,salary_standardized,description_tokens
0,0,0,Data Analyst,Meta,Anywhere,via LinkedIn,In the intersection of compliance and analytic...,"['15 hours ago', '101K‚Äì143K a year', 'Work fro...",eyJqb2JfdGl0bGUiOiJEYXRhIEFuYWx5c3QiLCJodGlkb2...,https://encrypted-tbn0.gstatic.com/images?q=tb...,...,NaN,101K‚Äì143K,a year,122000.0,101000.0,143000.0,NaN,122000.0,122000.0,"['tableau', 'r', 'python', 'sql']"
1,1,1,Data Analyst,ATC,United States,via LinkedIn,Job Title: Entry Level Business Analyst / Prod...,"['12 hours ago', 'Full-time', 'Health insurance']",eyJqb2JfdGl0bGUiOiJEYXRhIEFuYWx5c3QiLCJodGlkb2...,https://encrypted-tbn0.gstatic.com/images?q=tb...,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,[]
2,2,2,Aeronautical Data Analyst,"Garmin International, Inc.","Olathe, KS",via Indeed,Overview:\n\nWe are seeking a full-time...\nAe...,"['18 hours ago', 'Full-time']",eyJqb2JfdGl0bGUiOiJBZXJvbmF1dGljYWwgRGF0YSBBbm...,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,['sql']
3,3,3,Data Analyst - Consumer Goods - Contract to Hire,Upwork,Anywhere,via Upwork,Enthusiastic Data Analyst for processing sales...,"['12 hours ago', '15‚Äì25 an hour', 'Work from h...",eyJqb2JfdGl0bGUiOiJEYXRhIEFuYWx5c3QgLSBDb25zdW...,NaN,...,NaN,15‚Äì25,an hour,20.0,15.0,25.0,20.0,NaN,41600.0,"['powerpoint', 'excel', 'power_bi']"
4,4,4,Data Analyst | Workforce Management,Krispy Kreme,United States,via LinkedIn,Overview of Position\n\nThis position will be ...,"['7 hours ago', '90K‚Äì110K a year', 'Contractor']",eyJqb2JfdGl0bGUiOiJEYXRhIEFuYWx5c3QgfCBXb3JrZm...,https://encrypted-tbn0.gstatic.com/images?q=tb...,...,NaN,90K‚Äì110K,a year,100000.0,90000.0,110000.0,NaN,100000.0,100000.0,"['powerpoint', 'excel', 'outlook', 'word']"

In [8]:
# Shape of data
print("Rows:", df.shape[0])
print("Columns:", df.shape[1])

Rows: 61953
Columns: 27

In [9]:
# Check column names and data types
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 61953 entries, 0 to 61952
Data columns (total 27 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Unnamed: 0           61953 non-null  int64
 1   index                61953 non-null  int64
 2   title                61953 non-null  object
 3   company_name         61953 non-null  object
 4   location             61916 non-null  object
 5   via                  61944 non-null  object
 6   description          61953 non-null  object
 7   extensions           61953 non-null  object
 8   job_id               61953 non-null  object
 9   thumbnail            38194 non-null  object
 10  posted_at            61763 non-null  object
 11  schedule_type        61707 non-null  object
 12  work_from_home       27980 non-null  object
 13  salary               10088 non-null  object
 14  search_term          61953 non-null  object
 15  date_time            61953 non-null  object
 16  search_location      61953 non-null  object
 17  commute_time         0 non-null      float64
 18  salary_pay           10088 non-null  object
 19  salary_rate          10088 non-null  object
 20  salary_avg           10088 non-null  float64
 21  salary_min           9512 non-null   float64
 22  salary_max           9512 non-null   float64
 23  salary_hourly        5900 non-null   float64
 24  salary_yearly        4069 non-null   float64
 25  salary_standardized  10088 non-null  float64
 26  description_tokens   61953 non-null  object
dtypes: float64(7), int64(2), object(18)
memory usage: 12.8+ MB

In [10]:
df.isnull().sum()
#check missing values in each column

Unnamed: 0                 0
index                      0
title                      0
company_name               0
location                  37
via                        9
description                0
extensions                 0
job_id                     0
thumbnail              23759
posted_at                190
schedule_type            246
work_from_home         33973
salary                 51865
search_term                0
date_time                  0
search_location            0
commute_time           61953
salary_pay             51865
salary_rate            51865
salary_avg             51865
salary_min             52441
salary_max             52441
salary_hourly          56053
salary_yearly          57884
salary_standardized    51865
description_tokens         0
dtype: int64

In [11]:
#STEP -2 DATA CLEANING 
# Drop unnecessary columns
df_clean = df.drop(columns=[
    'Unnamed: 0', 'index', 'thumbnail', 'commute_time', 
    'extensions', 'job_id', 'description_tokens'
])

In [12]:
df_clean.shape[1]

20

In [13]:
# Fill small missing text columns with 'Unknown'
df_clean['location'] = df_clean['location'].fillna('Unknown')
df_clean['via'] = df_clean['via'].fillna('Unknown')
df_clean['schedule_type'] = df_clean['schedule_type'].fillna('Unknown')
df_clean['work_from_home'] = df_clean['work_from_home'].fillna('Unknown')

In [14]:
# Convert date columns to datetime
# df_clean['posted_at'] = pd.to_datetime(df_clean['posted_at'], errors='coerce')
df_clean['date_time'] = pd.to_datetime(df_clean['date_time'], errors='coerce')

In [15]:
# Strip extra spaces in key columns
df_clean['title'] = df_clean['title'].str.strip()
df_clean['company_name'] = df_clean['company_name'].str.strip()

In [16]:
# Check results after data cleaning and preparation 
df_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 61953 entries, 0 to 61952
Data columns (total 20 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   title                61953 non-null  object
 1   company_name         61953 non-null  object
 2   location             61953 non-null  object
 3   via                  61953 non-null  object
 4   description          61953 non-null  object
 5   posted_at            61763 non-null  object
 6   schedule_type        61953 non-null  object
 7   work_from_home       61953 non-null  object
 8   salary               10088 non-null  object
 9   search_term          61953 non-null  object
 10  date_time            61953 non-null  datetime64[ns]
 11  search_location      61953 non-null  object
 12  salary_pay           10088 non-null  object
 13  salary_rate          10088 non-null  object
 14  salary_avg           10088 non-null  float64
 15  salary_min           9512 non-null   float64
 16  salary_max           9512 non-null   float64
 17  salary_hourly        5900 non-null   float64
 18  salary_yearly        4069 non-null   float64
 19  salary_standardized  10088 non-null  float64
dtypes: datetime64[ns](1), float64(6), object(13)
memory usage: 9.5+ MB

In [17]:
# Remove 'posted_at' column because it contains non-standard text values 
# like '12 hours ago', which cannot be converted to proper date/time format.
# It‚Äôs not useful for analysis in this form.
df_clean.drop(columns=['posted_at'], inplace=True)

In [18]:
#KPI's CREATION

In [19]:
# KPI 1 ‚Äî Total Job Listings
total_jobs = df_clean.shape[0]
print("üìä Total Job Listings:", total_jobs)

üìä Total Job Listings: 61953

In [20]:
# KPI 2 ‚Äî Top 10 Companies Hiring
top_companies = df_clean['company_name'].value_counts().head(10).reset_index()
top_companies.columns = ['Company Name', 'Job Listings']

print("üè¢ Top 10 Companies Hiring:")
display(top_companies)

üè¢ Top 10 Companies Hiring:

         Company Name  Job Listings
0              Upwork          7533
1        Talentify.io          2118
2             Walmart          1829
3        vmysmartpros          1415
4                Dice           862
5        EDWARD JONES           747
6           Corporate           612
7  Cox Communications           538
8      Insight Global           483
9                iSay           353

In [21]:
# KPI 3 ‚Äî Top 10 Job Titles
top_titles = df_clean['title'].value_counts().head(10).reset_index()
top_titles.columns = ['Job Title', 'Job Listings']

print("üíº Top 10 Job Titles:")
display(top_titles)

üíº Top 10 Job Titles:

                       Job Title  Job Listings
0                   Data Analyst          6444
1            Senior Data Analyst          1748
2                 Data Scientist           931
3                Data Analyst II           644
4          Business Data Analyst           495
5              Lead Data Analyst           428
6            Survey Data Analyst           422
7                  Data Engineer           375
8  Business Intelligence Analyst           343
9               Data Analyst III           284

In [22]:
# KPI 4 ‚Äî Remote Jobs %
total_jobs = len(df_clean)
df_clean['work_from_home'] = df_clean['work_from_home'].astype(str)

remote_jobs = df_clean[df_clean['work_from_home'].str.lower() == 'true']
remote_job_count = len(remote_jobs)
remote_job_percent = (remote_job_count / total_jobs) * 100

print(f"üè† Remote Jobs: {remote_job_count} out of {total_jobs} ({remote_job_percent:.2f}%)")

üè† Remote Jobs: 27980 out of 61953 (45.16%)

In [23]:
# KPI 5 ‚Äî Average Salary (if available)
avg_salary = df_clean['salary_avg'].mean()
print(f"üí∞ Average Salary (across listings with data): ${avg_salary:,.2f}")

üí∞ Average Salary (across listings with data): $42,100.23

In [24]:
# KPI 6 ‚Äî Jobs by Schedule Type
jobs_by_schedule = df_clean['schedule_type'].value_counts().reset_index()
jobs_by_schedule.columns = ['Schedule Type', 'Job Listings']

print("üïí Jobs by Schedule Type:")
display(jobs_by_schedule)

üïí Jobs by Schedule Type:

                           Schedule Type  Job Listings
0                              Full-time         45082
1                             Contractor          9284
2               Contractor and Temp work          3130
3                Full-time and Part-time          1187
4                              Part-time          1144
5                             Internship           516
6               Full-time and Contractor           349
7                Full-time and Temp work           283
8                                Unknown           246
9               Full-time and Internship           192
10                             Temp work           169
11  Full-time, Part-time, and Internship            92
12  Full-time, Contractor, and Temp work            85
13  Part-time, Contractor, and Temp work            47
14              Part-time and Contractor            30
15                             Volunteer            27
16              Part-time and Internship            21
17  Full-time, Part-time, and Contractor            13
18              Temp work and Internship             9
19               Part-time and Temp work             9
20                Full-time and Per diem             9
21   Full-time, Part-time, and Temp work             5
22               Contractor and Per diem             4
23  Full-time, Temp work, and Internship             4
24                              Per diem             2
25    Full-time, Part-time, and Per diem             2
26               Full-time and Volunteer             2
27               Part-time and Full-time             2
28                Part-time and Per diem             2
29    Full-time, Temp work, and Per diem             2
30   Contractor, Temp work, and Per diem             2
31  Part-time, Temp work, and Internship             1
32                Temp work and Per diem             1

In [25]:
# KPI 7 ‚Äî Job Posting Trend Over Time
df_clean['month'] = df_clean['date_time'].dt.to_period('M')
trend_over_time = df_clean.groupby('month').size().reset_index(name='job_listings')

print("üìÖ Job Posting Trend (Monthly):")
display(trend_over_time)

üìÖ Job Posting Trend (Monthly):

      month  job_listings
0   2022-11          2159
1   2022-12          3329
2   2023-01          3682
3   2023-02          2828
4   2023-03          2727
5   2023-04          2493
6   2023-05          2357
7   2023-06          2362
8   2023-07          2560
9   2023-08          3008
10  2023-09          3085
11  2023-10          3364
12  2023-11          2601
13  2023-12          2346
14  2024-01          2298
15  2024-02          2534
16  2024-03          2106
17  2024-04          1694
18  2024-05          1737
19  2024-06          1618
20  2024-07          1470
21  2024-09           449
22  2024-10           926
23  2024-11           629
24  2024-12          1008
25  2025-01          1914
26  2025-02          1938
27  2025-03          1725
28  2025-04          1006

In [26]:
# ‚úÖ Create KPI Summary Table

kpi_summary = pd.DataFrame({
    "KPI": [
        "Total Job Listings",
        "Top 10 Companies Hiring",
        "Top 10 Job Titles",
        "Remote Jobs %",
        "Average Salary (from salary_avg)",
        "Jobs by Schedule Type",
        "Job Posting Trend Over Time"
    ],
    "Result": [
        f"{df_clean.shape[0]:,}",
        ", ".join(top_companies['Company Name'].tolist()),
        ", ".join(top_titles['Job Title'].tolist()),
        f"{remote_job_percent:.2f}%",
        f"${avg_salary:,.2f}",
        "Full-time, Contractor, Temp Work lead the market",
        "Job postings peaked around Jan 2023 and dipped mid-2024, showing recovery in early 2025"
    ]
})

display(kpi_summary)

,KPI,Result
0,Total Job Listings,"61,953"
1,Top 10 Companies Hiring,"Upwork, Talentify.io, Walmart, vmysmartpros, D..."
2,Top 10 Job Titles,"Data Analyst, Senior Data Analyst, Data Scient..."
3,Remote Jobs %,45.16%
4,Average Salary (from salary_avg),"$42,100.23"
5,Jobs by Schedule Type,"Full-time, Contractor, Temp Work lead the market"
6,Job Posting Trend Over Time,Job postings peaked around Jan 2023 and dipped...

In [27]:
# Save KPI summary to CSV for Power BI import
kpi_summary.to_csv("kpi_summary.csv", index=False)

In [ ]:
# Export the cleaned dataset to Excel
df_clean.to_excel("gsearch_jobs_clean.xlsx", index=False)